{"modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "vggish", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 96, 64, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "pool2", "class_name": "MaxPooling2D", "config": {"name": "pool2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv3_1", "class_name": "Conv2D", "config": {"name": "conv3_1", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool2", 0, 0, {}]]]}, {"name": "conv3_2", "class_name": "Conv2D", "config": {"name": "conv3_2", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3_1", 0, 0, {}]]]}, {"name": "pool3", "class_name": "MaxPooling2D", "config": {"name": "pool3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv3_2", 0, 0, {}]]]}, {"name": "conv4_1", "class_name": "Conv2D", "config": {"name": "conv4_1", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "conv4_2", "class_name": "Conv2D", "config": {"name": "conv4_2", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv4_1", 0, 0, {}]]]}, {"name": "pool4", "class_name": "MaxPooling2D", "config": {"name": "pool4", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv4_2", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["pool4", 0, 0, {}]]]}, {"name": "fc1_1", "class_name": "Dense", "config": {"name": "fc1_1", "trainable": true, "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc1_2", "class_name": "Dense", "config": {"name": "fc1_2", "trainable": true, "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc1_1", 0, 0, {}]]]}, {"name": "fc2", "class_name": "Dense", "config": {"name": "fc2", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc1_2", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["fc2", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of69", "group1-shard2of69", "group1-shard3of69", "group1-shard4of69", "group1-shard5of69", "group1-shard6of69", "group1-shard7of69", "group1-shard8of69", "group1-shard9of69", "group1-shard10of69", "group1-shard11of69", "group1-shard12of69", "group1-shard13of69", "group1-shard14of69", "group1-shard15of69", "group1-shard16of69", "group1-shard17of69", "group1-shard18of69", "group1-shard19of69", "group1-shard20of69", "group1-shard21of69", "group1-shard22of69", "group1-shard23of69", "group1-shard24of69", "group1-shard25of69", "group1-shard26of69", "group1-shard27of69", "group1-shard28of69", "group1-shard29of69", "group1-shard30of69", "group1-shard31of69", "group1-shard32of69", "group1-shard33of69", "group1-shard34of69", "group1-shard35of69", "group1-shard36of69", "group1-shard37of69", "group1-shard38of69", "group1-shard39of69", "group1-shard40of69", "group1-shard41of69", "group1-shard42of69", "group1-shard43of69", "group1-shard44of69", "group1-shard45of69", "group1-shard46of69", "group1-shard47of69", "group1-shard48of69", "group1-shard49of69", "group1-shard50of69", "group1-shard51of69", "group1-shard52of69", "group1-shard53of69", "group1-shard54of69", "group1-shard55of69", "group1-shard56of69", "group1-shard57of69", "group1-shard58of69", "group1-shard59of69", "group1-shard60of69", "group1-shard61of69", "group1-shard62of69", "group1-shard63of69", "group1-shard64of69", "group1-shard65of69", "group1-shard66of69", "group1-shard67of69", "group1-shard68of69", "group1-shard69of69"], "weights": [{"name": "conv1_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv1_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2_1/bias", "shape": [128], "dtype": "float32"}, {"name": "conv3_1_1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv3_1_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv3_2_1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv3_2_1/bias", "shape": [256], "dtype": "float32"}, {"name": "conv4_1_1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv4_1_1/bias", "shape": [512], "dtype": "float32"}, {"name": "conv4_2_1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv4_2_1/bias", "shape": [512], "dtype": "float32"}, {"name": "fc1_1_1/kernel", "shape": [12288, 4096], "dtype": "float32"}, {"name": "fc1_1_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "fc1_2_1/kernel", "shape": [4096, 4096], "dtype": "float32"}, {"name": "fc1_2_1/bias", "shape": [4096], "dtype": "float32"}, {"name": "fc2_1/kernel", "shape": [4096, 128], "dtype": "float32"}, {"name": "fc2_1/bias", "shape": [128], "dtype": "float32"}]}]}