{"modelTopology": {"keras_version": "2.1.6-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 20, "batch_input_shape": [null, 20], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_3", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 4, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_1"}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [20, 20], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [20], "name": "dense_2/bias"}, {"dtype": "float32", "shape": [20, 4], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_3/bias"}]}]}