{"modelTopology": {"keras_version": "2.1.6-tf", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_4", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 1071, "batch_input_shape": [null, 1071], "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "name": "dense_5", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 4, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_2"}}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"dtype": "float32", "shape": [1071, 1071], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [1071], "name": "dense_4/bias"}, {"dtype": "float32", "shape": [1071, 4], "name": "dense_5/kernel"}, {"dtype": "float32", "shape": [4], "name": "dense_5/bias"}]}]}