{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"Dense","config":{"units":8,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true,"batch_input_shape":[null,128],"dtype":"float32"}},{"class_name":"Dense","config":{"units":3,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true}}],"keras_version":"tfjs-layers 0.8.4","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model_noise.weights.bin"],"weights":[{"name":"dense_Dense13/kernel","shape":[128,8],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[8,3],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[3],"dtype":"float32"}]}]}